; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (clear ?x)
               (on-table ?x)
               (arm-empty)
               (holding ?x)
               (on ?x ?y))

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
                 (not (arm-empty))))

  (:action putdown
    :parameters  (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
                 (not (holding ?ob))))

  (:action stack
    :parameters  (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
                 (not (clear ?underob)) (not (holding ?ob))))

  (:action unstack
    :parameters  (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
                 (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-25)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 )
(:init
(arm-empty)
(on b1 b17)
(on b2 b15)
(on b3 b11)
(on b4 b2)
(on b5 b9)
(on b6 b23)
(on b7 b5)
(on-table b8)
(on b9 b8)
(on b10 b24)
(on b11 b18)
(on b12 b6)
(on b13 b16)
(on b14 b13)
(on b15 b3)
(on b16 b12)
(on b17 b7)
(on b18 b10)
(on-table b19)
(on b20 b21)
(on b21 b25)
(on b22 b4)
(on b23 b22)
(on b24 b1)
(on-table b25)
(clear b14)
(clear b19)
(clear b20)
)
(:goal
(and
(on-table b1)
(on b2 b18)
(on b3 b17)
(on b4 b22)
(on-table b5)
(on b6 b2)
(on b7 b12)
(on b8 b1)
(on b9 b6)
(on b10 b11)
(on b11 b3)
(on-table b12)
(on b13 b5)
(on b14 b7)
(on b15 b24)
(on b16 b23)
(on b17 b15)
(on b18 b16)
(on b19 b25)
(on-table b20)
(on b21 b19)
(on-table b22)
(on b23 b13)
(on b24 b21)
(on b25 b20))
)
)

; plan
1. (unstack b20 b21)
   deleted: (on b20 b21) (clear b20) (arm-empty)
   added: (holding b20) (clear b21)
   goals met: 0 of 25
2. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 1 of 25
3. (unstack b21 b25)
   deleted: (on b21 b25) (clear b21) (arm-empty)
   added: (holding b21) (clear b25)
   goals met: 1 of 25
4. (stack b21 b19)
   deleted: (clear b19) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b19)
   goals met: 2 of 25
5. (pickup b25)
   deleted: (clear b25) (on-table b25) (arm-empty)
   added: (holding b25)
   goals met: 2 of 25
6. (stack b25 b20)
   deleted: (clear b20) (holding b25)
   added: (arm-empty) (clear b25) (on b25 b20)
   goals met: 3 of 25
7. (unstack b14 b13)
   deleted: (on b14 b13) (clear b14) (arm-empty)
   added: (holding b14) (clear b13)
   goals met: 3 of 25
8. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 3 of 25
9. (unstack b13 b16)
   deleted: (on b13 b16) (clear b13) (arm-empty)
   added: (holding b13) (clear b16)
   goals met: 3 of 25
10. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 3 of 25
11. (unstack b16 b12)
   deleted: (on b16 b12) (clear b16) (arm-empty)
   added: (holding b16) (clear b12)
   goals met: 3 of 25
12. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 3 of 25
13. (unstack b12 b6)
   deleted: (on b12 b6) (clear b12) (arm-empty)
   added: (holding b12) (clear b6)
   goals met: 3 of 25
14. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 4 of 25
15. (unstack b6 b23)
   deleted: (on b6 b23) (clear b6) (arm-empty)
   added: (holding b6) (clear b23)
   goals met: 4 of 25
16. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 4 of 25
17. (unstack b23 b22)
   deleted: (on b23 b22) (clear b23) (arm-empty)
   added: (holding b23) (clear b22)
   goals met: 4 of 25
18. (stack b23 b13)
   deleted: (clear b13) (holding b23)
   added: (arm-empty) (clear b23) (on b23 b13)
   goals met: 5 of 25
19. (unstack b22 b4)
   deleted: (on b22 b4) (clear b22) (arm-empty)
   added: (holding b22) (clear b4)
   goals met: 5 of 25
20. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 6 of 25
21. (unstack b4 b2)
   deleted: (on b4 b2) (clear b4) (arm-empty)
   added: (holding b4) (clear b2)
   goals met: 6 of 25
22. (stack b4 b22)
   deleted: (clear b22) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b22)
   goals met: 7 of 25
23. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 7 of 25
24. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 8 of 25
25. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 8 of 25
26. (stack b16 b23)
   deleted: (clear b23) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b23)
   goals met: 9 of 25
27. (unstack b21 b19)
   deleted: (on b21 b19) (clear b21) (arm-empty)
   added: (holding b21) (clear b19)
   goals met: 8 of 25
28. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 8 of 25
29. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 8 of 25
30. (stack b19 b25)
   deleted: (clear b25) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b25)
   goals met: 9 of 25
31. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 9 of 25
32. (stack b21 b19)
   deleted: (clear b19) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b19)
   goals met: 10 of 25
33. (unstack b6 b2)
   deleted: (on b6 b2) (clear b6) (arm-empty)
   added: (holding b6) (clear b2)
   goals met: 9 of 25
34. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 9 of 25
35. (unstack b2 b15)
   deleted: (on b2 b15) (clear b2) (arm-empty)
   added: (holding b2) (clear b15)
   goals met: 9 of 25
36. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 9 of 25
37. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 9 of 25
38. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 10 of 25
39. (unstack b15 b3)
   deleted: (on b15 b3) (clear b15) (arm-empty)
   added: (holding b15) (clear b3)
   goals met: 10 of 25
40. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 10 of 25
41. (unstack b3 b11)
   deleted: (on b3 b11) (clear b3) (arm-empty)
   added: (holding b3) (clear b11)
   goals met: 10 of 25
42. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 10 of 25
43. (unstack b11 b18)
   deleted: (on b11 b18) (clear b11) (arm-empty)
   added: (holding b11) (clear b18)
   goals met: 10 of 25
44. (stack b11 b3)
   deleted: (clear b3) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b3)
   goals met: 11 of 25
45. (unstack b18 b10)
   deleted: (on b18 b10) (clear b18) (arm-empty)
   added: (holding b18) (clear b10)
   goals met: 11 of 25
46. (stack b18 b16)
   deleted: (clear b16) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b16)
   goals met: 12 of 25
47. (unstack b10 b24)
   deleted: (on b10 b24) (clear b10) (arm-empty)
   added: (holding b10) (clear b24)
   goals met: 12 of 25
48. (stack b10 b11)
   deleted: (clear b11) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b11)
   goals met: 13 of 25
49. (unstack b24 b1)
   deleted: (on b24 b1) (clear b24) (arm-empty)
   added: (holding b24) (clear b1)
   goals met: 13 of 25
50. (stack b24 b21)
   deleted: (clear b21) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b21)
   goals met: 14 of 25
51. (unstack b1 b17)
   deleted: (on b1 b17) (clear b1) (arm-empty)
   added: (holding b1) (clear b17)
   goals met: 14 of 25
52. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 15 of 25
53. (unstack b17 b7)
   deleted: (on b17 b7) (clear b17) (arm-empty)
   added: (holding b17) (clear b7)
   goals met: 15 of 25
54. (stack b17 b15)
   deleted: (clear b15) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b15)
   goals met: 16 of 25
55. (unstack b7 b5)
   deleted: (on b7 b5) (clear b7) (arm-empty)
   added: (holding b7) (clear b5)
   goals met: 16 of 25
56. (stack b7 b12)
   deleted: (clear b12) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b12)
   goals met: 17 of 25
57. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 17 of 25
58. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 18 of 25
59. (unstack b9 b8)
   deleted: (on b9 b8) (clear b9) (arm-empty)
   added: (holding b9) (clear b8)
   goals met: 18 of 25
60. (stack b9 b6)
   deleted: (clear b6) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b6)
   goals met: 19 of 25
61. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 19 of 25
62. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 20 of 25
63. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 20 of 25
64. (stack b14 b7)
   deleted: (clear b7) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b7)
   goals met: 21 of 25
65. (unstack b17 b15)
   deleted: (on b17 b15) (clear b17) (arm-empty)
   added: (holding b17) (clear b15)
   goals met: 20 of 25
66. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 20 of 25
67. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 20 of 25
68. (stack b15 b24)
   deleted: (clear b24) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b24)
   goals met: 21 of 25
69. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 21 of 25
70. (stack b17 b15)
   deleted: (clear b15) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b15)
   goals met: 22 of 25
71. (unstack b10 b11)
   deleted: (on b10 b11) (clear b10) (arm-empty)
   added: (holding b10) (clear b11)
   goals met: 21 of 25
72. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 21 of 25
73. (unstack b11 b3)
   deleted: (on b11 b3) (clear b11) (arm-empty)
   added: (holding b11) (clear b3)
   goals met: 20 of 25
74. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 20 of 25
75. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 20 of 25
76. (stack b3 b17)
   deleted: (clear b17) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b17)
   goals met: 21 of 25
77. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 21 of 25
78. (stack b11 b3)
   deleted: (clear b3) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b3)
   goals met: 22 of 25
79. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 22 of 25
80. (stack b10 b11)
   deleted: (clear b11) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b11)
   goals met: 23 of 25
81. (unstack b18 b16)
   deleted: (on b18 b16) (clear b18) (arm-empty)
   added: (holding b18) (clear b16)
   goals met: 22 of 25
82. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 22 of 25
83. (unstack b16 b23)
   deleted: (on b16 b23) (clear b16) (arm-empty)
   added: (holding b16) (clear b23)
   goals met: 21 of 25
84. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 21 of 25
85. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 21 of 25
86. (stack b18 b16)
   deleted: (clear b16) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b16)
   goals met: 22 of 25
87. (unstack b23 b13)
   deleted: (on b23 b13) (clear b23) (arm-empty)
   added: (holding b23) (clear b13)
   goals met: 21 of 25
88. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 21 of 25
89. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 21 of 25
90. (stack b13 b5)
   deleted: (clear b5) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b5)
   goals met: 22 of 25
91. (pickup b23)
   deleted: (clear b23) (on-table b23) (arm-empty)
   added: (holding b23)
   goals met: 22 of 25
92. (stack b23 b13)
   deleted: (clear b13) (holding b23)
   added: (arm-empty) (clear b23) (on b23 b13)
   goals met: 23 of 25
93. (unstack b18 b16)
   deleted: (on b18 b16) (clear b18) (arm-empty)
   added: (holding b18) (clear b16)
   goals met: 22 of 25
94. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 22 of 25
95. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 22 of 25
96. (stack b16 b23)
   deleted: (clear b23) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b23)
   goals met: 23 of 25
97. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 23 of 25
98. (stack b18 b16)
   deleted: (clear b16) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b16)
   goals met: 24 of 25
99. (unstack b9 b6)
   deleted: (on b9 b6) (clear b9) (arm-empty)
   added: (holding b9) (clear b6)
   goals met: 23 of 25
100. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 23 of 25
101. (unstack b6 b2)
   deleted: (on b6 b2) (clear b6) (arm-empty)
   added: (holding b6) (clear b2)
   goals met: 22 of 25
102. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 22 of 25
103. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 22 of 25
104. (stack b9 b6)
   deleted: (clear b6) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b6)
   goals met: 23 of 25
105. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 23 of 25
106. (stack b2 b18)
   deleted: (clear b18) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b18)
   goals met: 24 of 25
107. (unstack b9 b6)
   deleted: (on b9 b6) (clear b9) (arm-empty)
   added: (holding b9) (clear b6)
   goals met: 23 of 25
108. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 23 of 25
109. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 23 of 25
110. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 24 of 25
111. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 24 of 25
112. (stack b9 b6)
   deleted: (clear b6) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b6)
   goals met: 25 of 25
